src/DataProcessors/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Взаиморасчеты</name>
  <tabularSections>
    <name>НеоплаченныеРаботы</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекоЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>ЧеловекоЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОплаченыеРаботы</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекоЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/Взаиморасчеты/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СформироватьОплату(Команда)
	СформироватьОплатуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОплатуНаСервере()
	НовыйОплата = Документы.Оплата.СоздатьДокумент();
	ТЗ_Оплат = Объект.НеоплаченныеРаботы.Выгрузить();
	НовыйОплата.ОплаченыеРаботы.Загрузить(ТЗ_Оплат);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Заявка,
		|	ВзаиморасчетыОстатки.ВидРабот,
		|	ВзаиморасчетыОстатки.ЧеловекоЧасыОстаток КАК ЧеловекоЧасы,
		|	ВзаиморасчетыОстатки.СтоимостьРаботОстаток КАК СтоимостьРабот
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки";
	
	ТЗ_РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.НеоплаченныеРаботы.Загрузить(ТЗ_РезультатЗапроса);
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры
